app/views/orders/new.html.erb

<h5><strong>Order Details: </strong></h5>
<% if current_customer.shopping_cart_items.any? %>
---
SELECT  1 AS one FROM "shopping_cart_items" WHERE "shopping_cart_items"."customer_id" = $1 LIMIT $2  [["customer_id", 4], ["LIMIT", 1]]
SELECT "shopping_cart_items".* FROM "shopping_cart_items" WHERE "shopping_cart_items"."customer_id" = $1  [["customer_id", 4]]


<% if current_customer.delivery_addresses.any? %>
---
SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."customer_id" = $1 AND "delivery_addresses"."id" = $2 LIMIT $3  [["customer_id", 4], ["id", 2], ["LIMIT", 1]]