app/views/orders/show.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 4]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 4]]
SELECT  1 AS one FROM "orders" WHERE "orders"."customer_id" = $1 LIMIT $2  [["customer_id", 4], ["LIMIT", 1]]
---
<%= render 'shared/header' %>
<h4>Total Orders : <%= current_customer.orders.count %></h4>
<% if current_customer.orders.any? %>

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
      </tr>
      <% order.order_items.each do |order_item| %>