app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @customer = Customer.find_by(id: params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @customer = Customer.find_by(id: params[:id])

INSERT INTO "customers" ("name", "encrypted_password", "phone_number", "email", "salt", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @customer = Customer.new(customer_params)
    if @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "phone_number" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["phone_number", "9519519567"], ["updated_at", "2017-09-16 11:01:46.946731"], ["id", 1]]
---
  def update
    @customer = Customer.find_by(id: params[:id])
    if @customer.update_attributes(customer_params)