app/controllers/delivery_addresses_controller.rb

  def create
    @delivery_address = current_customer.delivery_addresses.create(delivery_address_params)
---
INSERT INTO "delivery_addresses" ("name", "address", "phone_number", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @delivery_address = current_customer.delivery_addresses.find_by(id: params[:id])
    @delivery_address.destroy
---
SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."customer_id" = $1 AND "delivery_addresses"."id" = $2 LIMIT $3  [["customer_id", 3], ["id", 8], ["LIMIT", 1]]
DELETE FROM "delivery_addresses" WHERE "delivery_addresses"."id" = $1  [["id", 8]]