app/controllers/orders_controller.rb

  def new
    @delivery_address = current_customer.delivery_addresses.find_by(id: params[:delivery_address_id])
---
SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."customer_id" = $1 AND "delivery_addresses"."id" = $2 LIMIT $3  [["customer_id", 4], ["id", 2], ["LIMIT", 1]]

  def create
    order = current_customer.orders.create(order_params)

    current_customer.shopping_cart_items.each do |item|
      order_item = add_order_item(item, order)
      order_item.save
---
INSERT INTO "orders" ("customer_id", "delivery_address_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["customer_id", 4], ["delivery_address_id", 2], ["created_at", "2017-09-16 11:29:00.491272"], ["updated_at", "2017-09-16 11:29:00.491272"]]
SELECT "shopping_cart_items".* FROM "shopping_cart_items" WHERE "shopping_cart_items"."customer_id" = $1  [["customer_id", 4]]
INSERT INTO "order_items" ("price", "quantity", "order_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["price", "1099.0"], ["quantity", 2], ["order_id", 1], ["product_id", 1], ["created_at", "2017-09-16 11:29:00.559040"], ["updated_at", "2017-09-16 11:29:00.559040"]]

  def destroy
    @order = current_customer.orders.find_by(id: params[:id]) rescue nil
    @order.destroy
---
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["customer_id", 6], ["id", 6], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 6]]