app/controllers/products_controller.rb

  def edit
    @product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "price", "description", "stock_quantity", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @product = Product.find_by(id: params[:id])

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "\r\nDell Laptop Ins 3543-5200U Ci5 5th Gen 4GB/500GB HD/2GB 15.6\"Display W/8 Silver"], ["updated_at", "2017-09-16 11:17:53.582083"], ["id", 7]]

  def destroy
    @product = Product.find_by(id: params[:id])
    @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 9]]