app/controllers/shopping_cart_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "shopping_cart_items".* FROM "shopping_cart_items" WHERE "shopping_cart_items"."customer_id" = $1 AND "shopping_cart_items"."product_id" = 1 LIMIT $2  [["customer_id", 4], ["LIMIT", 1]]
UPDATE "shopping_cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "shopping_cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2017-09-19 13:36:22.389672"], ["id", 29]]
INSERT INTO "shopping_cart_items" ("quantity", "customer_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["customer_id", 4], ["product_id", 1], ["created_at", "2017-09-16 11:25:49.071038"], ["updated_at", "2017-09-16 11:25:49.071038"]]
---
  def create
    selected_product = Product.find_by(id: params[:product_id])

    if @shopping_cart_item = current_customer.shopping_cart_items.find_by(product_id: selected_product)
      @shopping_cart_item.increment(:quantity)
    else
      @shopping_cart_item = current_customer.shopping_cart_items.new

      @shopping_cart_item.product = selected_product
      @shopping_cart_item.quantity = 1
    end

    if @shopping_cart_item.save

UPDATE "shopping_cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "shopping_cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2017-09-16 11:26:53.537205"], ["id", 1]]
---
  def add_quantity
    shopping_cart_item.increment(:quantity)

UPDATE "shopping_cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "shopping_cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2017-09-16 11:26:56.289023"], ["id", 1]]
---
  def reduce_quantity
    shopping_cart_item.decrement(:quantity) if shopping_cart_item.quantity > 1

SELECT  "shopping_cart_items".* FROM "shopping_cart_items" WHERE "shopping_cart_items"."customer_id" = $1 AND "shopping_cart_items"."id" = $2 LIMIT $3  [["customer_id", 5], ["id", 5], ["LIMIT", 1]]
DELETE FROM "shopping_cart_items" WHERE "shopping_cart_items"."id" = $1  [["id", 5]]
---
  def destroy
    @item = current_customer.shopping_cart_items.find_by(id: params[:id])
    @item.destroy