app/views/shopping_cart_items/show.html.erb

SELECT  1 AS one FROM "shopping_cart_items" WHERE "shopping_cart_items"."customer_id" = $1 LIMIT $2  [["customer_id", 4], ["LIMIT", 1]]
SELECT "shopping_cart_items".* FROM "shopping_cart_items" WHERE "shopping_cart_items"."customer_id" = $1  [["customer_id", 4]]
---
<%= render 'products/header' %>
<% if current_customer.shopping_cart_items.any? %>